var itemList = [  
{  
    "id": 1,  
    "items": [{  
        "id": 55555,  
        "name": "大英"  
    },  
    {  
        "id": 56374,  
        "name": "康定"  
    },  
    {  
        "id": 56371,  
        "name": "泸定"  
    },  
    {  
        "id": 56263,  
        "name": "丹巴"  
    },  
    {  
        "id": 56462,  
        "name": "九龙"  
    },
    {
    	"id": 56257,
    	"name": "理塘"
    },
    {
    	"id": 56441,
    	"name": "得荣"
    },
    {
    	"id": 56443,
    	"name": "乡城"
    },
    {
    	"id": 56357,
    	"name": "稻城"
    },
    {
    	"id": 56147,
    	"name": "白玉"
    },
    {
    	"id": 56251,
    	"name": "新龙"
    },
    {
    	"id": 56152,
    	"name": "色达"
    },
    {
    	"id": 56158,
    	"name": "炉霍"
    },
    {
    	"id": 56144,
    	"name": "德格"
    },
    {
    	"id": 56247,
    	"name": "巴塘"
    },
    {
    	"id": 56146,
    	"name": "甘孜"
    },
    {
    	"id": 56167,
    	"name": "道孚"
    },
    {
    	"id": 56038,
    	"name": "石渠"
    },
    {
    	"id": 56267,
    	"name": "雅江"
    },
    {
    	"id": 56172,
    	"name": "马尔康"
    },
    {
    	"id": 56171,
    	"name": "阿坝"
    },
    {
    	"id": 56173,
    	"name": "红原"
    },
    {
    	"id": 56182,
    	"name": "松潘"
    },
    {
    	"id": 56185,
    	"name": "黑水"
    },
    {
    	"id": 56168,
    	"name": "金川"
    },
    {
    	"id": 56178,
    	"name": "小金"
    },
    {
    	"id": 56184,
    	"name": "理县"
    },
    {
    	"id": 56183,
    	"name": "汶川"
    },
    {
    	"id": 56079,
    	"name": "若尔盖"
    },
    {
    	"id": 56097,
    	"name": "九寨沟"
    },
    {
    	"id": 56180,
    	"name": "茂县"
    },
    {
    	"id": 56164,
    	"name": "壤塘"
    }
    
    
    
    
    ],  
    "name": "川西高原"  
},  
{  
    "id": 2,  
    "items": [{  
        "id": 56666,  
        "name": "攀枝花"  
    },  
    {  
        "id": 56674,  
        "name": "仁和区"  
    },  
    {  
        "id": 56670,  
        "name": "米易"  
    },  
    {  
        "id": 56665,  
        "name": "盐边"  
    },  
    {  
        "id": 56571,  
        "name": "西昌"  
    },
    {  
        "id": 56569,  
        "name": "德昌"  
    },
    {  
        "id": 56474,  
        "name": "冕宁"  
    },
    {  
        "id": 56485,  
        "name": "雷波"  
    },
    {  
        "id": 56473,  
        "name": "甘洛"  
    },
    {  
        "id": 56475,  
        "name": "越西"  
    },
    {  
        "id": 56487,  
        "name": "美姑"  
    },
    {  
        "id": 56478,  
        "name": "喜得"  
    },
    {  
        "id": 56479,  
        "name": "昭觉"  
    },
    {  
        "id": 56575,  
        "name": "普格"  
    },
    {  
        "id": 56580,  
        "name": "布拖"  
    },
    {  
        "id": 56584,  
        "name": "金阳"  
    },
    {  
        "id": 56671,  
        "name": "会理"  
    },
    {  
        "id": 56565,  
        "name": "盐源"  
    },
    {  
        "id": 56459,  
        "name": "木里"  
    },
    {  
        "id": 56578,  
        "name": "宁南"  
    },
    {  
        "id": 56675,  
        "name": "会东"  
    }
    
    
    
    
    ],  
    "name": "攀西高原"  
},
{  
    "id": 3,  
    "items": [{  
        "id": 57313,  
        "name": "巴中"  
    },  
    {  
        "id": 57324,  
        "name": "平昌"  
    },  
    {  
        "id": 57216,  
        "name": "南江"  
    },  
    {  
        "id": 57320,  
        "name": "通江"  
    },  
    {  
        "id": 57328,  
        "name": "达州"  
    },
    {  
        "id": 57420,  
        "name": "大竹"  
    },
    {  
        "id": 57413,  
        "name": "渠县"  
    },
    {  
        "id": 57237,  
        "name": "万源"  
    },
    {  
        "id": 57326,  
        "name": "宣汉"  
    },
    {  
        "id": 57329,  
        "name": "开江"  
    },
    {  
        "id": 57411,  
        "name": "南充"  
    },
    {  
        "id": 57309,  
        "name": "西充"  
    },
    {  
        "id": 57318,  
        "name": "营山"  
    },
    {  
        "id": 57317,  
        "name": "蓬安"  
    },
    {  
        "id": 57306,  
        "name": "阆中"  
    },
    {  
        "id": 57315,  
        "name": "仪陇"  
    },
    {  
        "id": 57314,  
        "name": "南部"  
    },
    {  
        "id": 57415,  
        "name": "广安"  
    },
    {  
        "id": 57416,  
        "name": "邻水"  
    },
    {  
        "id": 57414,  
        "name": "岳池"  
    },
    {  
        "id": 57417,  
        "name": "武胜"  
    }
    
    
    
    ],  
    "name": "盆地东部"  
},
{  
    "id": 4,  
    "items": [{  
        "id": 56396,  
        "name": "自贡"  
    },  
    {  
        "id": 56399,  
        "name": "富顺"  
    },  
    {  
        "id": 56394,  
        "name": "荣县"  
    },  
    {  
        "id": 57418,  
        "name": "泸州"  
    },  
    {  
        "id": 57604,  
        "name": "纳溪"  
    },
    {  
        "id": 57508,  
        "name": "泸县"  
    },
    {  
        "id": 57608,  
        "name": "叙永"  
    },
    {  
        "id": 57605,  
        "name": "古蔺"  
    },
    {  
        "id": 57603,  
        "name": "合江"  
    },
    {  
        "id": 56492,  
        "name": "宜宾"  
    },
    {  
        "id": 56493,  
        "name": "南溪"  
    },
    {  
        "id": 56593,  
        "name": "长宁"  
    },
    {  
        "id": 56592,  
        "name": "高县"  
    },
    {  
        "id": 56494,  
        "name": "屏山"  
    },
    {  
        "id": 56499,  
        "name": "珙县"  
    },
    {  
        "id": 56496,  
        "name": "兴文"  
    },
    {  
        "id": 56498,  
        "name": "筠连"  
    },
    {  
        "id": 57600,  
        "name": "江安"  
    }
    
    
    
    
    ],  
    "name": "盆地南部"  
},
{  
    "id": 5,  
    "items": [{  
        "id": 56388,  
        "name": "五通桥"  
    },  
    {  
        "id": 56290,  
        "name": "新都"  
    },  
    {  
        "id": 56286,  
        "name": "龙泉驿"  
    },  
    {  
        "id": 56296,  
        "name": "金堂"  
    },  
    {  
        "id": 56288,  
        "name": "双流"  
    },
    {  
        "id": 56189,  
        "name": "彭州"  
    },
    {  
        "id": 56181,  
        "name": "崇州"  
    },
    {  
        "id": 56285,  
        "name": "大邑"  
    },
    {  
        "id": 56284,  
        "name": "邛崃"  
    },
    {  
        "id": 56281,  
        "name": "蒲江"  
    },
    {  
        "id": 56276,  
        "name": "新津"  
    },
    {  
        "id": 56272,  
        "name": "郫县"  
    },
    {  
        "id": 56187,  
        "name": "温江"  
    },
    {  
        "id": 56188,  
        "name": "都江堰"  
    },
    {  
        "id": 56198,  
        "name": "德阳"  
    },
    {  
        "id": 56291,  
        "name": "广汉"  
    },
    {  
        "id": 56197,  
        "name": "什邡"  
    },
    {  
        "id": 56186,  
        "name": "绵竹"  
    },
    {  
        "id": 56199,  
        "name": "中江"  
    },
    {  
        "id": 56196,  
        "name": "绵阳"  
    },
    {  
        "id": 57308,  
        "name": "盐亭"  
    },
    {  
        "id": 57304,  
        "name": "梓潼"  
    },
    {  
        "id": 57307,  
        "name": "三台"  
    },
    {  
        "id": 56190,  
        "name": "安县"  
    },
    {  
        "id": 56194,  
        "name": "北川"  
    },
    {  
        "id": 56195,  
        "name": "江油"  
    },
    {  
        "id": 56193,  
        "name": "平武"  
    },
    {  
        "id": 57206,  
        "name": "广元"  
    },
    {  
        "id": 57217,  
        "name": "旺苍"  
    },
    {  
        "id": 57303,  
        "name": "苍溪"  
    },
    {  
        "id": 57208,  
        "name": "剑阁"  
    },
    {  
        "id": 57204,  
        "name": "青川"  
    }
    
    ],  
    "name": "盆地西部"  
},  
{  
    "id": 6,  
    "items": [{  
        "id": 56386,  
        "name": "乐山"  
    },  
    {  
        "id": 56384,  
        "name": "峨眉"  
    },  
    {  
        "id": 56491,  
        "name": "峨眉山"  
    },  
    {  
        "id": 56382,  
        "name": "夹江"  
    },  
    {  
        "id": 56390,  
        "name": "井研"  
    },
    {  
        "id": 56389,  
        "name": "犍为"  
    },
    {  
        "id": 56490,  
        "name": "沐川"  
    },
    {  
        "id": 56387,  
        "name": "峨边"  
    },
    {  
        "id": 56480,  
        "name": "马边"  
    },
    {  
        "id": 56391,  
        "name": "眉山"  
    },
    {  
        "id": 56297,  
        "name": "仁寿"  
    },
    {  
        "id": 56383,  
        "name": "青神"  
    },
    {  
        "id": 56289,  
        "name": "彭山"  
    },
    {  
        "id": 56381,  
        "name": "丹棱"  
    },
    {  
        "id": 56380,  
        "name": "洪雅"  
    },
    {  
        "id": 56287,  
        "name": "雅安"  
    },
    {  
        "id": 56378,  
        "name": "石棉"  
    },
    {  
        "id": 56373,  
        "name": "荥经"  
    },
    {  
        "id": 56376,  
        "name": "汉源"  
    },
    {  
        "id": 56273,  
        "name": " 宝兴"  
    },
    {  
        "id": 56279,  
        "name": "芦山"  
    },
    {  
        "id": 56278,  
        "name": "天全"  
    },
    {  
        "id": 56280,  
        "name": "名山"  
    }
    ],  
    "name": "盆地西南"  
}, 
{  
    "id": 7,  
    "items": [{  
        "id": 57405,  
        "name": "遂宁"  
    },  
    {  
        "id": 57402,  
        "name": "蓬溪"  
    },  
    {  
        "id": 57401,  
        "name": "射洪"  
    },  
    { 
        "id": 56298,  
        "name": "彭山"  
    },  
    {  
        "id": 56295,  
        "name": "简阳"  
    },
    {  
        "id": 57407,  
        "name": "乐至"  
    },
    {  
        "id": 57503,  
        "name": "内江"  
    },
    {  
        "id": 57507,  
        "name": "隆昌"  
    },
    {  
        "id": 56393,  
        "name": "资中"  
    },
    {  
        "id": 56395,  
        "name": "威远"  
    }
    
    ],  
    "name": "盆地中部"  
}
]  